In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4,7,-5,4])

In [4]:
obj

0    4
1    7
2   -5
3    4
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  4], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,7,-5,3],index=["d","b","a","c"])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['d']

4

In [10]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [11]:
"n" in obj2

False

In [12]:
"d" in obj2

True

In [13]:
sdata = {'ohio':35000,'texas':71000,'oregon':16000,'utah':5000}

In [14]:
obj3 = pd.Series(sdata)

In [15]:
obj3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [19]:
states = ["c","ohio","oregon","texas"]
obj4 = pd.Series(sdata,index=states)

In [20]:
obj4

c             NaN
ohio      35000.0
oregon    16000.0
texas     71000.0
dtype: float64

In [21]:
pd.isnull(obj4)

c          True
ohio      False
oregon    False
texas     False
dtype: bool

In [22]:
pd.notnull(obj4)

c         False
ohio       True
oregon     True
texas      True
dtype: bool

In [23]:
obj4.isnull()

c          True
ohio      False
oregon    False
texas     False
dtype: bool

In [25]:
obj4.name ="p"
obj4.index.name = "states"

In [26]:
obj4

states
c             NaN
ohio      35000.0
oregon    16000.0
texas     71000.0
Name: p, dtype: float64

In [28]:
data  = {'states':['ohio','ohio','ohio','nevada','nevada','nevada'],
         'year':[2000,2001,2002,2001,2002,2003],
         'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [29]:
frame

   states  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [31]:
frame.columns.values

array(['states', 'year', 'pop'], dtype=object)

In [34]:
frame.loc[0]

states    ohio
year      2000
pop        1.5
Name: 0, dtype: object

In [35]:
frame["debt"] = 111

In [36]:
frame

   states  year  pop  debt
0    ohio  2000  1.5   111
1    ohio  2001  1.7   111
2    ohio  2002  3.6   111
3  nevada  2001  2.4   111
4  nevada  2002  2.9   111
5  nevada  2003  3.2   111

In [37]:
frame["debt"] = list(range(6))

In [38]:
frame

   states  year  pop  debt
0    ohio  2000  1.5     0
1    ohio  2001  1.7     1
2    ohio  2002  3.6     2
3  nevada  2001  2.4     3
4  nevada  2002  2.9     4
5  nevada  2003  3.2     5

In [39]:
frame["eee"] = frame.states=="ohio"

In [40]:
frame

   states  year  pop  debt    eee
0    ohio  2000  1.5     0   True
1    ohio  2001  1.7     1   True
2    ohio  2002  3.6     2   True
3  nevada  2001  2.4     3  False
4  nevada  2002  2.9     4  False
5  nevada  2003  3.2     5  False

In [41]:
del frame["eee"]

In [42]:
frame

   states  year  pop  debt
0    ohio  2000  1.5     0
1    ohio  2001  1.7     1
2    ohio  2002  3.6     2
3  nevada  2001  2.4     3
4  nevada  2002  2.9     4
5  nevada  2003  3.2     5

In [45]:
pop = {'nevdada':{2001:2.4,2002:2.9},
       'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [46]:
frame2 = pd.DataFrame(pop)

In [47]:
frame2

      nevdada  ohio
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [48]:
frame2.T

         2000  2001  2002
nevdada   NaN   2.4   2.9
ohio      1.5   1.7   3.6

In [49]:
pdata = {'ohio':frame2["ohio"][:-1],
         'nev':frame2["nevdada"][:-1]}

In [50]:
pd.DataFrame(pdata)

      ohio  nev
2000   1.5  NaN
2001   1.7  2.4

In [54]:
obj = pd.Series(range(5),index=['d','e','a','b','c'])

In [55]:
obj

d    0
e    1
a    2
b    3
c    4
dtype: int64

In [56]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [57]:
obj2

a    2
b    3
c    4
d    0
e    1
dtype: int64

In [58]:
obj2.reindex(range(5),method="ffill")

TypeError: '<' not supported between instances of 'int' and 'str'

In [59]:
obj2.drop("a")

b    3
c    4
d    0
e    1
dtype: int64

In [60]:
obj2.drop(["a","b"])

c    4
d    0
e    1
dtype: int64

In [62]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index = ["o","c","u","n"],
                    columns = ["one","two","three","four"])

In [63]:
data

   one  two  three  four
o    0    1      2     3
c    4    5      6     7
u    8    9     10    11
n   12   13     14    15

In [64]:
data.drop(["o","c"])

   one  two  three  four
u    8    9     10    11
n   12   13     14    15

In [65]:
data.drop("two",axis=1)

   one  three  four
o    0      2     3
c    4      6     7
u    8     10    11
n   12     14    15

In [66]:
data.drop(["one","two"],axis="columns")

   three  four
o      2     3
c      6     7
u     10    11
n     14    15

In [67]:
data[2:4]

   one  two  three  four
u    8    9     10    11
n   12   13     14    15

In [69]:
data.loc['c',["two","three"]]

two      5
three    6
Name: c, dtype: int64

In [70]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: u, dtype: int64

In [71]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: u, dtype: int64

In [72]:
data.iloc[[1,2],[2,0,1]]

   three  one  two
c      6    4    5
u     10    8    9

In [73]:
data.loc[:'u','two']

o    1
c    5
u    9
Name: two, dtype: int64

In [75]:
data.iloc[:,:3]

   one  two  three
o    0    1      2
c    4    5      6
u    8    9     10
n   12   13     14

In [74]:
data.iloc[:,:3][data.three>5]

   one  two  three
c    4    5      6
u    8    9     10
n   12   13     14

##### loc Dataframe 
##### ilocDataframe

In [77]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                   columns=list("bcd"),
                   index = ["o","t","c"])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                   columns=list("bde"),
                   index = ["u","o","t","O"])

In [78]:
df1

     b    c    d
o  0.0  1.0  2.0
t  3.0  4.0  5.0
c  6.0  7.0  8.0

In [79]:
df2

     b     d     e
u  0.0   1.0   2.0
o  3.0   4.0   5.0
t  6.0   7.0   8.0
O  9.0  10.0  11.0

In [80]:
df1+df2

     b   c     d   e
O  NaN NaN   NaN NaN
c  NaN NaN   NaN NaN
o  3.0 NaN   6.0 NaN
t  9.0 NaN  12.0 NaN
u  NaN NaN   NaN NaN

In [85]:
df1.loc["o","b"]= np.nan

In [86]:
df1

     b    c    d
o  NaN  1.0  2.0
t  3.0  4.0  5.0
c  6.0  7.0  8.0
1  NaN  NaN  NaN
0  NaN  NaN  NaN

In [87]:
df1.add(df2,fill_value=0)

     b    c     d     e
o  3.0  1.0   6.0   5.0
t  9.0  4.0  12.0   8.0
c  6.0  7.0   8.0   NaN
1  NaN  NaN   NaN   NaN
0  NaN  NaN   NaN   NaN
u  0.0  NaN   1.0   2.0
O  9.0  NaN  10.0  11.0

In [88]:
series = df2.iloc[0]

In [89]:
series

b    0.0
d    1.0
e    2.0
Name: u, dtype: float64

In [90]:
df2 - series

     b    d    e
u  0.0  0.0  0.0
o  3.0  3.0  3.0
t  6.0  6.0  6.0
O  9.0  9.0  9.0

In [91]:
df2.sub(series,axis="index")

    b   d   e
O NaN NaN NaN
b NaN NaN NaN
d NaN NaN NaN
e NaN NaN NaN
o NaN NaN NaN
t NaN NaN NaN
u NaN NaN NaN

In [92]:
f = lambda x :x.max()-x.min()

In [95]:
df2

     b     d     e
u  0.0   1.0   2.0
o  3.0   4.0   5.0
t  6.0   7.0   8.0
O  9.0  10.0  11.0

In [93]:
df2.apply(f)

b    9.0
d    9.0
e    9.0
dtype: float64

In [94]:
df2.apply(f,axis="columns")

u    2.0
o    2.0
t    2.0
O    2.0
dtype: float64

In [96]:
def f1(x):
    return pd.Series([x.min(),x.max()],index=["max","min"])

In [97]:
df2.apply(f1)

       b     d     e
max  0.0   1.0   2.0
min  9.0  10.0  11.0

In [100]:
df2.applymap(lambda x: '%.2f' % x)

      b      d      e
u  0.00   1.00   2.00
o  3.00   4.00   5.00
t  6.00   7.00   8.00
O  9.00  10.00  11.00

In [101]:
df2.sort_index()

     b     d     e
O  9.0  10.0  11.0
o  3.0   4.0   5.0
t  6.0   7.0   8.0
u  0.0   1.0   2.0

In [102]:
df2.sort_index(axis=1)

     b     d     e
u  0.0   1.0   2.0
o  3.0   4.0   5.0
t  6.0   7.0   8.0
O  9.0  10.0  11.0

In [104]:
df2.sort_index(axis=1,ascending=False)

      e     d    b
u   2.0   1.0  0.0
o   5.0   4.0  3.0
t   8.0   7.0  6.0
O  11.0  10.0  9.0

In [106]:
df2.sort_values(by="b")

     b     d     e
u  0.0   1.0   2.0
o  3.0   4.0   5.0
t  6.0   7.0   8.0
O  9.0  10.0  11.0

In [107]:
df2.rank(method="first")

     b    d    e
u  1.0  1.0  1.0
o  2.0  2.0  2.0
t  3.0  3.0  3.0
O  4.0  4.0  4.0

In [109]:
df2.rank(method="max",ascending=False)

     b    d    e
u  4.0  4.0  4.0
o  3.0  3.0  3.0
t  2.0  2.0  2.0
O  1.0  1.0  1.0

In [110]:
df2.rank(axis="columns")

     b    d    e
u  1.0  2.0  3.0
o  1.0  2.0  3.0
t  1.0  2.0  3.0
O  1.0  2.0  3.0

"average": <br/>
"min"<br/>
"max"<br/>
"first": <br/>
"dense": "min"1

In [111]:
df2.index.is_unique

True

In [112]:
df2.sum()

b    18.0
d    22.0
e    26.0
dtype: float64

In [113]:
df2.sum(axis=1)

u     3.0
o    12.0
t    21.0
O    30.0
dtype: float64

In [114]:
df2.mean(axis="columns",skipna=False)

u     1.0
o     4.0
t     7.0
O    10.0
dtype: float64

In [116]:
#
df2.idxmax()

b    O
d    O
e    O
dtype: object

In [117]:
#
df2.cumsum()

      b     d     e
u   0.0   1.0   2.0
o   3.0   5.0   7.0
t   9.0  12.0  15.0
O  18.0  22.0  26.0

In [118]:
df2.describe()

              b          d          e
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000

In [120]:
df2["b"].value_counts()

9.0    1
6.0    1
3.0    1
0.0    1
Name: b, dtype: int64